{"TuanTexts":["大哉乾元万物资始乃统天云行雨施品物流形大明终始六位时成时乘六龙以御天乾道变化各正性命保合大和乃利贞首出庶物万国威宁","至哉坤元万物资生乃顺承天坤厚载物德合无疆含弘光大品物咸亨牝马地类行地无疆柔顺利贞君子君子攸行先迷失道後顺得常西南得朋乃与类行东北丧朋乃终有庆安贞之吉应地无疆","屯刚柔始交而难生动乎险中大亨贞雷雨之动满盈天造草昧宜寻建侯而不宁","蒙山下有险险而止蒙蒙亨以亨行时中也匪我求童蒙童蒙求我志应也初筮告以刚中也再三渎渎则不告渎蒙也蒙以养正圣功也","需须也险在前也刚健而不陷其义不困穷矣需有孚光亨贞吉位乎天位以正中也利涉大川往有功也","讼上刚下险险而健讼讼有孚窒惕中吉刚来而得中也终凶讼不可成也利见大人尚中正也不利涉大川入于渊也","师众也贞正也能以众正可以王矣刚中而应行险而顺以此毒天下而民従之吉又何咎矣","比吉也比辅也下顺従也原筮元永贞无咎以刚中也不宁方来上下应也后夫凶其道穷也","小畜柔得位而上下应之曰小畜健而巽刚中而志行乃亨密云不雨尚往也自我西郊施未行也","履柔履刚也说而应乎乾是以履虎尾不咥人亨刚中正履帝位而不疚光明也","泰小往大来吉亨则是天地交而万物通也上下交而其志同也内阳而外阴内健而外顺内君子而外小人君子道长小人道消也","否之匪人不利君子贞大往小来则是天地不交而万物不通也上下不交而天下无邦也内阴而外阳内柔而外刚内小人而外君子小人道长君子道消也","同人柔得位得中而应乎乾曰同人同人曰同人于野亨利涉大川乾行也文明以健中正而应君子正也唯君子为能通天下之志","大有柔得尊位大中而上下应之曰大有其德刚健而文明应乎天而时行是以元亨","谦亨天道下济而光明地道卑而上行天道亏盈而益谦地道变盈而流谦鬼神害盈而福谦人道恶盈而好谦谦尊而光卑而不可逾君子之终也","豫刚应而志行顺以动豫豫顺以动故天地如之而况建侯行师乎天地以顺动故日月不过而四时不忒圣人以顺动则刑罚清而民服豫之时义大矣哉","随刚来而下柔动而说随大亨贞无咎而天下随时随时之义大矣哉","蛊刚上而柔下巽而止蛊蛊元亨而天下治也利涉大川往有事也先甲三日后甲三日终则有始天行也","临刚浸而长说而顺刚中而应大亨以正天之道也至于八月有凶消不久也","大观在上顺而巽中正以观天下观盥而不荐有孚颙若下观而化也观天之神道而四时不忒圣人以神道设教而天下服矣","颐中有物曰噬嗑噬嗑而亨刚柔分动而明雷电合而章柔得中而上行虽不当位利用狱也","贲亨柔来而文刚故亨分刚上而文柔故小利有攸往刚柔交错天文也文明以止人文也观乎天文以察时变观乎人文以化成天下","剥剥也柔变刚也不利有攸往小人长也顺而止之观象也君子尚消息盈虚天行也","复亨刚反动而以顺行是以出入无疾朋来无咎反复其道七日来复天行也利有攸往刚长也复其见天地之心乎","无妄刚自外来而为主于内动而健刚中而应大亨以正天之命也其匪正有眚不利有攸往无妄之往何之矣天命不祐行矣哉","大畜刚健笃实辉光日新其德刚上而尚贤能止健大正也不家食吉养贤也利涉大川应乎天也","颐贞吉养正则吉也观颐观其所养也自求口实观其自养也天地养万物圣人养贤以及万民颐之时大矣哉","大过大者过也栋挠本末弱也刚过而中巽而说行利有攸往乃亨大过之时大矣哉","习坎重险也水流而不盈行险而不失其信维心亨乃以刚中也行有尚往有功也天险不可升也地险山川丘陵也王公设险以守其国险之时用大矣哉","离丽也日月丽乎天百谷草木丽乎土重明以丽乎正乃化成天下柔丽乎中正故是以畜牝牛吉也","咸感也柔上而刚下二气感应以相与止而说男下女是以亨利贞取女吉也天地感而万物化生圣人感人心而天下和平观其所感而天地万物之情可见矣","恒久也刚上而柔下雷风相与巽而动刚柔皆应恒恒亨无咎利贞久于其道也天地之道恒久而不已也利有攸往终则有始也日月得天而能久照四时变化而能久成圣人久于其道而天下化成观其所恒而天地万物之情可见矣","遁亨遁而亨也刚当位而应与时行也小利贞浸而长也遁之时义大矣哉","大壮大者壮也刚以动故壮大壮利贞大者正也正大而天地之情可见矣","晋进也明出地上顺而丽乎大明柔进而上行是以康侯用锡马蕃庶昼日三接也","明入地中明夷内文明而外柔顺以蒙大难文王以之利艰贞晦其明也内难而能正其志箕子以之","家人女正位乎内男正位乎外男女正天地之大义也家人有严君焉父母之谓也父父子子兄兄弟弟夫夫妇妇而家道正正家而天下定矣","睽火动而上泽动而下二女同居其志不同行说而丽乎明柔进而上行得中而应乎刚是以小事吉天地睽而其事同也男女睽而其志通也万物睽而其事类也睽之时用大矣哉","蹇难也险在前也见险而能止知矣哉蹇利西南往得中也不利东北其道穷也利见大人往有功也当位贞吉以正邦也蹇之时用大矣哉","解险以动动而免乎险解解利西南往得众也其来复吉乃得中也有攸往夙吉往有功也天地解而雷雨作雷雨作而百果草木皆甲坼解之时大矣哉","损损下益上其道上行损而有孚元吉无咎可贞利有攸往曷之用二簋可用享二簋应有时损刚益柔有时损益盈虚与时偕行","益损上益下民说无疆自上下下其道大光利有攸往中正有庆利涉大川木道乃行益动而巽日进无疆天施地生其益无方凡益之道与时偕行","夬决也刚决柔也健而说决而和扬于王庭柔乘五刚也孚号有厉其危乃光也告自邑不利即戎所尚乃穷也利有攸往刚长乃终也","姤遇也柔遇刚也勿用取女不可与长也天地相遇品物咸章也刚遇中正天下大行也姤之时义大矣哉","萃聚也顺以说刚中而应故聚也王假有庙致孝享也利见大人亨聚以正也用大牲吉利有攸往顺天命也观其所聚而天地万物之情可见矣","柔以时升巽而顺刚中而应是以大亨用见大人勿恤有庆也南征吉志行也","困刚掩也险以说因而不失其所亨其唯君子乎贞大人吉以刚中也有言不信尚口乃穷也","巽乎水而上水井井养而不穷也改邑不改井乃以刚中也汔至亦未繘井未有功也羸其瓶是以凶也","革水火相息二女同居其志不相得曰革已日乃孚革而信之文明以说大亨以正革而当其悔乃亡天地革而四时成汤武革命顺乎天而应乎人革之时大矣哉","鼎象也以木巽火亨饪也圣人亨以享上帝而大亨以养圣贤巽而耳目聪明柔进而上行得中而应乎刚是以元亨","震亨震来虩虩恐致福也笑言哑哑后有则也震惊百里惊远而惧迩也不丧匕鬯出可以守宗庙社稷以为祭主也","艮止也时止则止时行则行动静不失其时其道光明艮其止止其所也上下敌应不相与也是以不获其身行其庭不见其人无咎也","渐之进也女归吉也进得位往有功也进以正可以正邦也其位刚得中也止而巽动不穷也","归妹天地之大义也天地不交而万物不兴归妹人之终始也说以动所归妹也征凶位不当也无攸利柔乘刚也","丰大也明以动故丰王假之尚大也勿忧宜日中宜照天下也日中则昃月盈则食天地盈虚与时消息而况于人乎况于鬼神乎","旅小亨柔得中乎外而顺乎刚止而丽乎明是以小亨旅贞吉也旅之时义大矣哉","重巽以申命刚巽乎中正而志行柔皆顺乎刚是以小亨利有攸往利见大人","兑说也刚中而柔外说以利贞是以顺乎天而应乎人说以先民民忘其劳说以犯难民忘其死说之大民劝矣哉","涣亨刚来而不穷柔得位乎外而上同王假有庙王乃在中也利涉大川乘木有功也","节亨刚柔分而刚得中苦节不可贞其道穷也说以行险当位以节中正以通天地节而四时成节以制度不伤财不害民","中孚柔在内而刚得中说而巽孚乃化邦也豚鱼吉信及豚鱼也利涉大川乘木舟虚也中孚以利贞乃应乎天也","小过小者过而亨也过以利贞与时行也柔得中是以小事吉也刚失位而不中是以不可大事也有飞鸟之象焉飞鸟遗之音不宜上宜下大吉上逆而下顺也","既济亨小者亨也利贞刚柔正而位当也初吉柔得中也终止则乱其道穷也","未济亨柔得中也小狐汔济未出中也濡其尾无攸利不续终也虽不当位刚柔应也"]}